tap "koekeishiya/formulae"
brew "bat"
brew "black"
brew "btop"
brew "cmake"
brew "codespell"
brew "deno"
brew "direnv"
brew "dprint"
brew "duf"
brew "dust"
brew "entr"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-delta"
brew "glow"
brew "gopls"
brew "httpie"
brew "imagemagick"
brew "isort"
brew "jq"
brew "lazygit"
brew "lua-language-server"
brew "mise"
brew "neofetch"
brew "neovim"
brew "ninja"
brew "node"
brew "pnpm"
brew "prettierd"
brew "python@3.12"
brew "ripgrep"
brew "ruff"
brew "rust-analyzer"
brew "shellcheck"
brew "shfmt"
brew "starship"
brew "stylua"
brew "tailwindcss-language-server"
brew "tldr"
brew "tree-sitter"
brew "typescript-language-server"
brew "uv"
brew "vscode-langservers-extracted"
brew "vue-language-server"
brew "yaml-language-server"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "discord"
cask "font-jetbrains-mono-nerd-font"
cask "iina"
cask "kitty"
cask "qbittorrent"
cask "steam"
